papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/3dTube/base/partitioned.compressible/constant/fluid/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      flowProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nu              nu [0 2 -1 0 0 0 0] 3e-6;
rho             rho [1 -3 0 0 0 0 0] 1000;

// The dynamic viscosity is used only for sonicLiquidFluid
mu              mu [1 -1 -1 0 0 0 0] 3e-3;

// For piso/transientSimple
transportModel  Newtonian;

// ************************************************************************* //
